# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.

a = [1, 2, 3, 4, 5, 11, 14, 24, 35, 87, 298, 201]
b = []
for i in a:
    if i%2 == 0:
        b.append(i / 4)
    else:
        b.append((i * 2))
print(b)