# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]

import math
a = [1, 2, 3, 4, 9, 121, -14, 24, 324, -87, 289, 201]
z = []
for i in a:
    if i > 0:
        c = math.sqrt(i)
        if c % 1 == 0:
            z.append(math.ceil(c))
    else:
        continue
print(z)