# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4

import math
print("введите коэффициенты a, b и c квадратного уравнения...")
a = int(input("a = "))
b = int(input("b = "))
c = int(input("c = "))
D = b*b - 4*a*c
if D >= 0:
    X1 = (-b + math.sqrt(D))/2*a
    X2 = (-b - math.sqrt(D))/2*a
    print("первый корень равен ", X1)
    print("второй корень равен ", X2)
else:
    print("нет корней")
    