# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.

i = int(input("write a number, please "))
while (i // 10) > 0:
    a = i % 10
    print(a)
    i = i // 10
print(i)
